src/xiaofang.Dispatch-History-Alert-Message-Request.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns="urn:xiaofang">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:Dispatch-History-Alert-Message-Request>
   <session-id></session-id>
   <history-alert-id></history-alert-id>
   <from-message-id></from-message-id>
   <from-time></from-time>
   <max-message-count></max-message-count>
  </ns:Dispatch-History-Alert-Message-Request>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
